Repository: lecktor/Lecktor-Firmware
Catalog: lang/po/new/*_new.po
Languages: et

source: 0.3 or older
et: 0.3 v≠i vanem

source: FS v0.3 or older
et: FS v0.3 v≠i vanem

source: 0.4 or newer
et: 0.4 v≠i uuem

source: FS v0.4 or newer
et: FS v0.4 v≠i uuem

source: unknown state
et: teadmata olek

source: of 4
et: 4st

source: of 9
et: 9st

source: WARNING:x0aCrash detectionx0adisabled inx0aStealth mode
et: HOIATUS:x0aKokkup≠rke tuvastusx0avÑlja lÅlitatudx0ahÑÑletus reziimis

source: >Cancel
et: >TÅhista

source: Adjusting Z:
et: Seadistan Z:

source: All correct
et: K≠ik ≠ige

source: All is done. Happy printing!
et: K≠ik on valmis. Head printimist!

source: Ambient
et: ömbritsev

source: and press the knob
et: ja vajuta nuppu

source: Are left and right Z~carriages all up?
et: Kas vasak ja parem Z-kandur on l≠puni Åleval?

source: Auto home
et: Algasendisse

source: AutoLoad filament
et: Autolae filament

source: Autoloading filament available only when filament sensor is turned on...
et: Filamendi autolaadimine on ainult saadaval kui filamendi andur on sees...

source: Autoloading filament is active, just press the knob and insert filament...
et: Filamendi autolaadimine on saadaval, vajuta nuppu ja sisesta filament...

source: Axis length
et: Telje pikkus

source: Axis
et: Telg

source: Bed / Heater
et: Alus / Kuumuti

source: Bed done
et: Alus valmis

source: Bed Heating
et: Aluse kuumutamine

source: Bed level correct
et: Aluse k≠rgus paigas

source: Belt test
et: Rihma test

source: Bed leveling failed. Sensor didnt trigger. Debris on nozzle? Waiting for reset.
et: Aluse seadistamine eba≠nnestus. Andur ei tuvastanud. Praht otsal? Ootan taaskÑivitust.

source: Bright
et: Ere

source: Brightness
et: Eredus

source: Bed
et: Alus

source: Belt status
et: Rihma staatus

source: Blackout occurred. Recover print?
et: Voolukatkestus tuvastatud. Taasta print?

source: Calibrating home
et: Kalibreerin algasendit

source: Calibrate XYZ
et: Kalibreeri XYZ

source: Calibrate Z
et: Kalibreeri Z

source: Calibrate
et: Kalibreeri

source: Calibrating XYZ. Rotate the knob to move the Z carriage up to the end stoppers. Click when done.
et: Kalibreerin XYZ. Pîîra nuppu, et liigutada Z kandur Åles l≠pulÅlititeni. Vajuta kui valmis.

source: Calibrating Z
et: Kalibreerin Z

source: Calibrating Z. Rotate the knob to move the Z carriage up to the end stoppers. Click when done.
et: Kalibreerin Z. Pîîra nuppu, et liigutada Z kandur Åles l≠pulÅlititeni. Vajuta kui valmis.

source: Calibration done
et: Kalibreerimine valmis

source: Calibration
et: Kalibreerimine

source: Cancel
et: TÅhista

source: Card removed
et: MÑlukaart eemaldatud

source: Checking file
et: Kontrollin faili

source: Color not correct
et: VÑrv pole ≠ige

source: Cooldown
et: Jahtumine

source: Copy selected language?
et: Kopeeri valitud keel?

source: Crash det.
et: Kokkup≠rke tuvastus.

source: Choose a filament for the First Layer Calibration and select it in the on-screen menu.
et: Vali filament esimese kihi kalibreerimiseks ja vali see ekraanil menÅÅst.

source: Crash detected.
et: Kokkup≠rge tuvastatud.

source: Crash detected. Resume print?
et: Kokkup≠rge tuvastatud. JÑtka printimist?

source: Crash
et: P≠rge

source: Current
et: Praegune

source: Date:
et: KuupÑev:

source: Community made
et: Kogukonna tehtud

source: Disable steppers
et: Seiska stepperid

source: Distance between tip of the nozzle and the bed surface has not been set yet. Please follow the manual, chapter First steps, section First layer calibration.
et: Kaugus otsiku ja aluspinna vahel pole seadistatud. Palun jÑrgi manuaali peatÅkk First steps sektsioon First layer calibration.

source: Cont.
et: JÑtk.

source: Do you want to repeat last step to readjust distance between nozzle and heatbed?
et: Kas te soovite korrata eelmist sammu, et taasseadistada kaugus otsiku ja aluse vahel?

source: E-correct:
et: E-parandus:

source: Eject filament
et: VÑljuta filament

source: Ejecting filament
et: VÑljutan filamenti

source: Endstop not hit
et: L≠pulÅlitini ei j≠utud

source: Endstop
et: L≠pulÅliti

source: Endstops
et: L≠pulÅlitid

source: Error - static memory has been overwritten
et: Error- staatiline mÑlu on Ålekirjutatud

source: Cut filament
et: L≠ika filament

source: Cutter
et: L≠ikaja

source: Cutting filament
et: L≠ikan filamenti

source: ERROR: Filament sensor is not responding, please check connection.
et: ERROR: Filamendi andur ei vasta. Palun kontrolli Åhendust.

source: Dim
et: HÑmar

source: Extruder fan:
et: Ekstruuderi puhur:

source: Extruder info
et: Ekstruuderi info

source: Extruder
et: Ekstruuder

source: Fail stats MMU
et: Vea andmed MMU

source: F. autoload
et: F. autolaadimine

source: Fail stats
et: Vea andmed

source: Fan speed
et: Ventilaatori kiirus

source: Fan test
et: Ventilaatori test

source: Fans check
et: Ventilaatori kontroll

source: Fil. runouts
et: Fil. otsajooks

source: Filament extruding & with correct color?
et: Filament eraldub ja on ≠iget vÑrvi?

source: Filament not loaded
et: Filament pole laetud

source: Filament sensor
et: Filamendi andur

source: Filament used
et: Filamenti kasutatud

source: Print time
et: Printimise aeg

source: FS Action
et: FS Tegevus

source: File incomplete. Continue anyway?
et: Fail poolik. JÑtka ikkagi?

source: Finishing movements
et: L≠pu liigutused

source: First layer cal.
et: Esimese kihi kal.

source: First, I will run the selftest to check most common assembly problems.
et: Esmalt, ma teen enesetesti k≠ige tavalisemate kokkupanemise probleemide tuvastuseks.

source: Fix the issue and then press button on MMU unit.
et: Paranda probleem ja vajuta nuppu MMU peal.

source: Flow
et: Voolamine

source: Front print fan?
et: Eesmine ventilaator?

source: Front side[um]
et: Eesmine[um]

source: Front/left fans
et: Eesmine/vasak ventilaator

source: Heater/Thermistor
et: Kuumuti/Termistor

source: Heating disabled by safety timer.
et: Kuumutamine vÑlja lÅlitatud ohutus taimeri poolt.

source: Heating done.
et: Kuumutamine valmis.

source: Heating
et: Kuumutamine

source: Hi, I am your Original Prusa i3 printer. Would you like me to guide you through the setup process?
et: Tere, ma olen teie Original Prusa i3 printer. Kas te soovite, et ma juhendaks teid lÑbi algseadistuse?

source: Change filament
et: Vaheta filament

source: Change success!
et: Vahetus ≠nnestunud!

source: Changed correctly?
et: Vahetatud ≠igesti?

source: Checking bed
et: Kontrollin alust

source: Checking endstops
et: Kontrollin l≠pulÅliteid

source: Checking hotend
et: Kontrollin otsikut

source: Checking sensors
et: Kontrollin andureid

source: Checking X axis
et: Kontrollin X telge

source: Checking Y axis
et: Kontrollin Y telge

source: Checking Z axis
et: Kontrollin Z telge

source: Choose extruder:
et: Vali ekstruuder:

source: Choose filament:
et: Vali filament:

source: I will run xyz calibration now. It will take approx. 12 mins.
et: Kalibreerin xyz telge. See v≠tab umbes 12 minutit.

source: I will run z calibration now.
et: Z kalibreerimine.

source: Info screen
et: Info ekraan

source: Insert filament
et: Sisesta filament

source: Is filament loaded?
et: Kas filament on laetud?

source: Is steel sheet on heatbed?
et: Kas plaat on kuumutusalusel?

source: Last print failures
et: Viimased t≠rked

source: Hi, I am your Original Prusa i3 printer. I will guide you through a short setup process, in which the Z-axis will be calibrated. Then, you will be ready to print.
et: Tere, ma olen teie Original Prusa i3 printer. Viin teid lÑbi lÅhikese seadistuse, milles Z-telg kalibreeritakse. Siis olete valmis printima.

source: If you have additional steel sheets, calibrate their presets in Settings - HW Setup - Steel sheets.
et: Kui teil on lisa teras plaate, kalibreerige nende seaded Seaded - Riistvara seaded - Terasplaadid.

source: Last print
et: Viimane print

source: Left hotend fan?
et: Vasak ventilaator?

source: Left
et: Vasak

source: Left side [um]
et: Vasak kÅlg [um]

source: Lin. correction
et: Lin. korrektsioon

source: Live adjust Z
et: Z sÑttimine

source: Insert the filament (do not load it) into the extruder and then press the knob.
et: Sisesta filament (Ñra lae seda) ekstruuderisse ja vajuta nuppu.

source: Load filament
et: Lae filament

source: Loading color
et: VÑrvi laadimine

source: Loading filament
et: Filamendi laadimine

source: Loose pulley
et: L≠tv rihm

source: Load to nozzle
et: Lae otsikusse

source: M117 First layer cal.
et: M117 Esimese kihi kal.

source: Main
et: PeamenÅÅ

source: Level Bright
et: Tase ere

source: Level Dimmed
et: Tase hÑmardatud

source: Measuring reference height of calibration point
et: M≠≠dan kalibreerimispunkti k≠rgust

source: Mesh Bed Leveling
et: Mesh aluse seadistus

source: MMU OK. Resuming position...
et: MMU OK. Taastan asendist...

source: MMU OK. Resuming temperature...
et: MMU OK. Taastan temeperatuuri...

source: Measured skew
et: M≠≠detud kalle

source: MMU fails
et: MMU viga

source: MMU load failed
et: MMU laadimine eba≠nnestus

source: MMU load fails
et: MMU laadimine eba≠nnestus

source: MMU OK. Resuming...
et: MMU OK. JÑtkan...

source: Mode
et: Reziim

source: MK3 firmware detected on MK3S printer
et: MK3 pÅsivara tuvastatud MK3S printeris

source: Normal
et: Normaal

source: Silent
et: Vaikne

source: MMU needs user attention.
et: MMU vajab kontrollimist.

source: MMU power fails
et: MMU voolu viga

source: Stealth
et: HÑÑletu

source: Auto power
et: Auto v≠imsus

source: High power
et: K≠rge v≠imsus

source: MMU2 connected
et: MMU2 Åhendatud

source: Motor
et: Mootor

source: Move axis
et: Liiguta telge

source: Move X
et: Liiguta X

source: Move Y
et: Liiguta Y

source: Move Z
et: Liiguta Z

source: No move.
et: Liikumine puudub.

source: No SD card
et: MÑlukaart puudub

source: No
et: Ei

source: Not connected
et: Mitte Åhendatud

source: New firmware version available:
et: Uus pÅsivara versioon saadaval:

source: Not spinning
et: Ei pîîrle

source: Now I will calibrate distance between tip of the nozzle and heatbed surface.
et: NÅÅd ma kalibreerin kauguse otsiku ja aluse pinna vahel.

source: Now I will preheat nozzle for PLA.
et: NÅÅd ma kuumutan otsiku PLA jaoks.

source: Nozzle
et: Otsik

source: Old settings found. Default PID, Esteps etc. will be set.
et: Vanad seaded leitud. Vaikimisi PID, Esteps jms. seatakse.

source: Now remove the test print from steel sheet.
et: Eemalda test print terasplaadilt.

source: Nozzle FAN
et: Otsiku ventilaator

source: Pause print
et: Peata print

source: PID cal.
et: PID kal.

source: PID cal. finished
et: PID kal. l≠petatud

source: PID calibration
et: PID kalibreerimine

source: PINDA Heating
et: PINDA kuumutamine

source: Place a sheet of paper under the nozzle during the calibration of first 4 points. If the nozzle catches the paper, power off the printer immediately.
et: Asetage paberileht otsiku alla esimese 4 punkti kalibreerimisel. Kui otsik t≠mbab paberit kaasa lÅlitage printer koheselt vÑlja.

source: Please clean heatbed and then press the knob.
et: Palun puhastage alus ja vajutage nuppu.

source: Please clean the nozzle for calibration. Click when done.
et: Palun puhastage otsik kalibreerimiseks. Vajutage kui valmis.

source: Please check :
et: Palun kontrollige:

source: Please check our handbook and fix the problem. Then resume the Wizard by rebooting the printer.
et: Palun kontrollige manuaali ja lahendage probleem. SeejÑrel taaskÑivitage printer.

source: Please open idler and remove filament manually.
et: Palun eemaldage filament kÑsitsi.

source: Please place steel sheet on heatbed.
et: Palun asetage terasplaat alusele.

source: Please press the knob to unload filament
et: Palun vajutage nuppu ja eemaldage filament

source: Please pull out filament immediately
et: Palun t≠mmake filament koheselt vÑlja

source: Please remove filament and then press the knob.
et: Palun eemaldage filament ja vajutage nuppu.

source: Please remove steel sheet from heatbed.
et: Palun eemaldage terasplaat aluselt.

source: Please run XYZ calibration first.
et: Palun tehke enne XYZ kalibreerimine.

source: Please update firmware in your MMU2. Waiting for reset.
et: Palun uuendage pÅsivara oma MMU2. Ootan taaskÑivitust.

source: Please wait
et: Palun oodake

source: Please remove shipping helpers first.
et: Palun eemaldage pakendamise hoidjad esimesena.

source: Preheat the nozzle!
et: Eelkuumutage otsik!

source: Preheat
et: Eelkuumutamine

source: Preheating nozzle. Please wait.
et: Eelkuumutan otsikut. Palun oodake.

source: Please upgrade.
et: Palun uuendage.

source: Press the knob to preheat nozzle and continue.
et: Vajutage nuppu, et eelkuumutada otsikut ja jÑtkake.

source: Pause
et: Paus

source: Power failures
et: Voolukatkestus

source: Print aborted
et: Print katkestatud

source: Preheating to load
et: Eelkuumutan laadimiseks

source: Preheating to unload
et: Eelkuumutan eemaldamiseks

source: Print fan:
et: Print ventilaator:

source: Print from SD
et: Prindi mÑlukaardilt

source: Press the knob
et: Vajutage nuppu

source: Print paused
et: Print peatatud

source: Press the knob to resume nozzle temperature.
et: Vajutage nuppu, et taastada otsiku temperatuur.

source: Printer has not been calibrated yet. Please follow the manual, chapter First steps, section Calibration flow.
et: Printer pole veel kalibreeritud. Palun jÑrgige manuaali, peatÅkk First steps, sektsioon Calibration flow.

source: Print FAN
et: Print ventilaator

source: Please insert filament into the extruder, then press the knob to load it.
et: Palun sisestage filament ekstruuderisse, seejÑrel vajutage nuppu, et see laadida.

source: Please insert filament into the first tube of the MMU, then press the knob to load it.
et: Palun sisestage filament MMU esimesse torusse, seejÑrel vajutage nuppu, et see laadida.

source: Please load filament first.
et: Palun laadige enne filament.

source: Rear side [um]
et: Tagumine kÅlg [um]

source: Please unload the filament first, then repeat this action.
et: Palun eemaldage enne filament, seejÑrel korrake seda tegevust.

source: Please check the IR sensor connection, unload filament if present.
et: Palun kontrollige IR anduri Åhendust, eemaldage filament kui olemas.

source: Recovering print
et: Taastan printi

source: Remove old filament and press the knob to start loading new filament.
et: Eemaldage vana filament ja vajutage nuppu, et alustada uue laadimist.

source: Reset XYZ calibr.
et: LÑhtesta XYZ kalibr.

source: Reset
et: LÑhtesta

source: Resume print
et: JÑtka printimist

source: Resuming print
et: JÑtkan printimist

source: Right side[um]
et: Parem kÅlg [um]

source: Running Wizard will delete current calibration results and start from the beginning. Continue?
et: See kustutab praeguse kalibreerimise ja alustab uuesti. JÑtka?

source: SD card
et: MÑlukaart

source: Right
et: Parem

source: Searching bed calibration point
et: Otsin aluse kalibreerimise punkti

source: Select language
et: Valige keel

source: Self test OK
et: Enesetest OK

source: Self test start
et: Enesetest algus

source: Selftest
et: Enesetest

source: Selftest error !
et: Enesetest error !

source: Selftest failed
et: Enesetest eba≠nnestunud

source: Selftest will be run to calibrate accurate sensorless rehoming.
et: Enesetest viiakse lÑbi tÑpseks anduritevabaks lÑhtestamiseks.

source: Select nozzle preheat temperature which matches your material.
et: Valige otsiku eelkuumutus temperatuur, mis sobib teie materjalile.

source: Set temperature:
et: Seatud temperatuur:

source: Settings
et: Seaded

source: Show end stops
et: NÑita l≠pulÅliteid

source: Sensor state
et: Anduri oleks

source: Some files will not be sorted. Max. No. of files in 1 folder for sorting is 100.
et: M≠ned failid ei saa sorteerida. Max kogus 1 kaustas sorteerimiseks on 100.

source: Sort
et: Sorteeri

source: None
et: Mitte Åhtegi

source: Time
et: Aeg

source: Severe skew:
et: T≠sine kalle:

source: Alphabet
et: TÑhestik

source: Sorting files
et: Sorteerin faile

source: Loud
et: Vali

source: Slight skew:
et: Kerge kalle:

source: Sound
et: Heli

source: Some problem encountered, Z-leveling enforced ...
et: Probleem leitud. Z seadistamine n≠utav.

source: Once
et: Korra

source: Speed
et: Kiirus

source: Spinning
et: Pîîrleb

source: Stable ambient temperature 21-26C is needed a rigid stand is required.
et: Stabiilne temperatuur 21-26C ja jÑik raam on vajalik.

source: Statistics
et: Statistika

source: Stop print
et: Seiska print

source: STOPPED.
et: SEISATUD.

source: Support
et: Tugi

source: Swapped
et: Vahetatud

source: Select filament:
et: Vali filament:

source: Temp. cal.
et: Temp. kal.

source: Select temperature which matches your material.
et: Valige temperatuur, mis sobib materjalile.

source: Temp. calibration
et: Temp. kalibreerimine

source: Temperature calibration failed
et: Temperatuuri kalibreerimine eba≠nnestus

source: Temperature calibration is finished and active. Temp. calibration can be disabled in menu Settings->Temp. cal.
et: Temperatuuri kalibreerimine on l≠petatud ning aktiivne. Temp. kal. saab vÑlja lÅlitada menÅÅs Seaded -> Temp. kal.

source: Sensor verified, remove the filament now.
et: Andur kontrollitud, eemaldage nÅÅd filament.

source: Temperature
et: Temperatuur

source: Temperatures
et: Temperatuurid

source: There is still a need to make Z calibration. Please follow the manual, chapter First steps, section Calibration flow.
et: Z kalibreerimine on vajalik. Palun jÑrgige manuaali peatÅkk First steps, sektsioon Calibration flow.

source: Total filament
et: Kogu filament

source: Total print time
et: Kogu printimise aeg

source: Tune
et: HÑÑlesta

source: Unload
et: TÅhjenda

source: Total failures
et: K≠ik eba≠nnestumised

source: to load filament
et: laadida filament

source: to unload filament
et: eemaldada filamenti

source: Unload filament
et: Eemalda filament

source: Unloading filament
et: Eemaldan filamenti

source: Total
et: K≠ik

source: Used during print
et: Printimisel kasutatud

source: Voltages
et: Pinged

source: unknown
et: teadmata

source: Wait for user...
et: Ootan kasutajat...

source: Waiting for nozzle and bed cooling
et: Ootan otsiku ja aluse jahtumist

source: Waiting for PINDA probe cooling
et: Ootan PINDA anduri jahtumist

source: Use unload to remove filament 1 if it protrudes outside of the rear MMU tube. Use eject if it is hidden in tube.
et: Kasutage eemaldamist, et eemaldada filament 1 kui see ulatub vÑlja MMU torust. Kasutage vÑljutamist, kui see on toru sees.

source: Warning: both printer type and motherboard type changed.
et: Hoiatus: printeri tÅÅp ja emaplaadi tÅÅp muutunud.

source: Warning: motherboard type changed.
et: Hoiatus: emaplaadi tÅÅp muutunud.

source: Warning: printer type changed.
et: Hoiatus: printeri tÅÅp muutunud.

source: Was filament unload successful?
et: Kas filamendi eemaldamine ≠nnestus?

source: Wiring error
et: Juhtmestuse viga

source: Wizard
et: Viisard

source: XYZ cal. details
et: XYZ kal. detailid

source: XYZ calibration failed. Please consult the manual.
et: XYZ kalibreerimine eba≠nnestus. Palun vaadake manuaali.

source: Yes
et: Jah

source: You can always resume the Wizard from Calibration -> Wizard.
et: Viisardit saab jÑtkata menÅÅst Kalibreerimine -> Viisard.

source: XYZ calibration all right. Skew will be corrected automatically.
et: XYZ kalibreerimine korras. Kalle parandatakse automaatselt.

source: XYZ calibration all right. X/Y axes are slightly skewed. Good job!
et: XYZ kalibreerimine korras. X/Y teljed on veidi kaldus. Hea tîî!

source: X-correct:
et: X-parandus:

source: XYZ calibration ok. X/Y axes are perpendicular. Congratulations!
et: XYZ kalibreerimine korras. X/Y teljed on risti. Palju ≠nne!

source: XYZ calibration compromised. Front calibration points not reachable.
et: XYZ kalibreerimine ohustatud. Eesmine kalibreerimispunkt pole saadaval.

source: XYZ calibration compromised. Right front calibration point not reachable.
et: XYZ kalibreerimine ohustatud. Eesmine parem kalibreerimispunkt pole saadaval.

source: Load all
et: Lae k≠ik

source: XYZ calibration failed. Bed calibration point was not found.
et: XYZ kalibreerimine eba≠nnestus. Aluse kalibreerimispunkti ei leitud.

source: XYZ calibration failed. Front calibration points not reachable.
et: XYZ kalibreerimine eba≠nnestus. Eesmist kalibreerimispunkti ei leitud.

source: XYZ calibration failed. Right front calibration point not reachable.
et: XYZ kalibreerimine eba≠nnestus. Eesmist paremat kalibreerimispunkti ei leitud.

source: Y distance from min
et: Y kaugus miinimumist

source: The printer will start printing a zig-zag line. Rotate the knob until you reach the optimal height. Check the pictures in the handbook (Calibration chapter).
et: Printer hakkab printima sik-sak joont. Pîîrake nuppu kuni leiate sobiva k≠rguse. Vaatake pilte manuaalist.

source: Verification failed, remove the filament and try again.
et: Kontrollimine eba≠nnestus, eemaldage filament ja proovige uuesti.

source: Y-correct:
et: Y-parandus:

source: Off
et: VÑljas

source: On
et: Sees

source: Back
et: Tagasi

source: Checks
et: Kontrollid

source: False triggering
et: Vale kÑivitamine

source: Firmware
et: PÅsivara

source: Strict
et: Range

source: Warn
et: Hoiata

source: HW Setup
et: Riistvara seaded

source: Magnets comp.
et: Magnetite komp.

source: MK3S firmware detected on MK3 printer
et: MK3S pÅsivara tuvastatud MK3 printeril

source: MMU Mode
et: MMU reziim

source: Mode change in progress ...
et: Reziimi muudatus...

source: Model
et: Mudel

source: Nozzle d.
et: Otsiku diam.

source: G-code sliced for a different level. Continue?
et: G-code l≠igatud teise taseme jaoks. JÑtka?

source: G-code sliced for a different level. Please re-slice the model again. Print cancelled.
et: G-code l≠igatud teise taseme jaoks. Palun l≠igake mudel uuesti. Print tÅhistatud.

source: G-code sliced for a different printer type. Continue?
et: G-code l≠igatud teise printeri tÅÅbi jaoks. JÑtka?

source: G-code sliced for a different printer type. Please re-slice the model again. Print cancelled.
et: G-code l≠igatud teise printeri tÅÅbi jaoks. Palun l≠igake mudel uuesti. Print tÅhistatud.

source: G-code sliced for a newer firmware. Continue?
et: G-code l≠igatud uuemale pÅsivarale. JÑtka?

source: G-code sliced for a newer firmware. Please update the firmware. Print cancelled.
et: G-code l≠igatud uuemale pÅsivarale. Palun uuendage pÅsivara. Print tÅhistatud.

source: Preheating to cut
et: Eelkuumutan l≠ikamiseks

source: Preheating to eject
et: Eelkuumutan vÑljutamiseks

source: Printer nozzle diameter differs from the G-code. Continue?
et: Printeri otsiku diameeter erineb G-code'st. JÑtka?

source: Printer nozzle diameter differs from the G-code. Please check the value in settings. Print cancelled.
et: Printeri otsiku diameeter erineb G-code'st. Palun kontrolliga vÑÑrtust seadetest. Print tÅhistatud.

source: %s level expected
et: %s tase oodatud

source: Rename
et: Nimeta Åmber

source: Select
et: Vali

source: Sensor info
et: Anduri info

source: Sheet
et: Plaat

source: Assist
et: Abista

source: Steel sheets
et: Terasplaadid

source: Z-correct:
et: Z-parandus:

source: Z-probe nr.
et: Z-anduri nr.
